app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
    def index
       @cars = Car.all

INSERT INTO "cars" ("make", "name", "description", "picture", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
    @car = Car.new(car_params)
    if @car.save

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
       @car = Car.find(params[:id])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
       @car = Car.find(params[:id])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "picture" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["picture", "bmw_320d.jpg"], ["updated_at", "2019-03-22 13:45:41.705865"], ["id", 1]]
---
    def update
       @car = Car.find(params[:id])
       if @car.update(car_params)

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
---
    def destroy
       @car = Car.find(params[:id])
       @car.destroy